       IDENTIFICATION DIVISION.
       PROGRAM-ID. TP1.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  GU                PIC X(4) VALUE 'GU  '.
       01  GN                PIC X(4) VALUE 'GN  '.
       01  IOA               PIC X(100).
       01  SSA-NQ-PLAN       PIC X(9) VALUE 'P010A'.
       LINKAGE SECTION.
       01  PCB1.
            05 PCB1-DBD1    PIC X(8).
            05 PCB1-NIV     PIC X(2).
            05 PCB1-CR      PIC X(2).
            05 PCB1-OPT     PIC X(4).
            05 FILLER       PIC X(4).
            05 PCB1-SEG     PIC X(8).
            05 PCB1-LGCLE   PIC S9(5) COMP.
            05 PCB1-SENSEG  PIC S9(5) COMP.
            05 PCB1-KFA     PIC X(17).
       PROCEDURE DIVISION.
            ENTRY 'DLITCBL' USING PCB1.
            CALL 'CBLTDLI' USING GU PCB1 IOA SSA-NQ-PLAN.
            DISPLAY 'PLAN : ' IOA.
            DISPLAY 'PCB : ' PCB1.
            PERFORM P01 THRU FIN-P01 UNTIL PCB1-CR = 'GB'.
            GOBACK.
       P01.
            CALL 'CBLTDLI' USING GN PCB1 IOA.
       10.
            EVALUATE PCB1-CR
                WHEN SPACE PERFORM SERV
                WHEN 'GK'  PERFORM PRODUIT WITH TEST AFTER
                                           UNTIL PCB1-CR NOT = SPACE
                WHEN 'GA'  PERFORM PLAN
                WHEN OTHER GOBACK.
       FIN-10.
       FIN-P01.
            EXIT.
       SERV.
            DISPLAY 'SERVICE : ' IOA.
            DISPLAY 'PCB : ' PCB1.
       PRODUIT.
            DISPLAY 'PRODUIT : ' IOA.
            DISPLAY 'PCB : ' PCB1.
            CALL 'CBLTDLI' USING GN PCB1 IOA.
            IF PCB1-CR NOT = SPACE GO TO 10.
       PLAN.
            DISPLAY 'PLAN : ' IOA.
            DISPLAY 'PCB : ' PCB1.
