       IDENTIFICATION DIVISION.
       PROGRAM-ID. COMPTYP.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 TEST-VALUES.
         02 T-EBCDIC PIC 9(7).
         02 T-COMP   PIC S9(9) COMP.
         02 T-COMP-3 PIC S9(4) COMP-3.
         02 T-COMP-5 PIC S9(9) COMP-5.

       PROCEDURE DIVISION.
           INITIALIZE TEST-VALUES
           PERFORM 1000000 TIMES
      *      ADD 1 TO T-EBCDIC
      *      ADD 1 TO T-COMP
      *      ADD 1 TO T-COMP-3
             ADD 1 TO T-COMP-5
           END-PERFORM
           GOBACK.
