       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXODATE.
       AUTHOR. QUENTIN POTEREK
       DATE-WRITTEN. 8 DECEMBRE 2021

      *
       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SOURCE-COMPUTER. IBM-370.
      *SOURCE-COMPUTER. IBM-370 WITH DEBUGGING MODE.
       OBJECT-COMPUTER. IBM-370.

      *
       DATA DIVISION.

       WORKING-STORAGE SECTION.
       77 DATE-ACTUELLE PIC 9(8).
       77 DATE-NAISSANCE PIC 9(8) VALUE 19940814.
       77 NBJ PIC 9(7).
       77 NBJ-VECUS PIC 9(7).
       77 NBJ-SHIFT PIC 9(5) VALUE 20000.
       77 DATE-SHIFT PIC 9(8).
       77 FMT-NBJ PIC ZZZZZZ9.
       77 FMT-DATE PIC 9999/99/99.

      *
       PROCEDURE DIVISION.
           PERFORM QUESTION-1 THRU QUESTION-3
           STOP RUN.

       QUESTION-1.
           MOVE FUNCTION CURRENT-DATE(1:8) TO DATE-ACTUELLE
           COMPUTE NBJ = FUNCTION INTEGER-OF-DATE(DATE-ACTUELLE)
           MOVE NBJ TO FMT-NBJ
           DISPLAY 'NOMBRE DE JOURS DEPUIS 01/01/1601: ' FMT-NBJ
           .
       QUESTION-2.
           COMPUTE NBJ-VECUS = FUNCTION INTEGER-OF-DATE(DATE-NAISSANCE)
           COMPUTE NBJ-VECUS = NBJ - NBJ-VECUS
           MOVE NBJ-VECUS TO FMT-NBJ
           DISPLAY 'NOMBRE DE JOURS DEPUIS 14/08/1994: ' FMT-NBJ
           .
       QUESTION-3.
           COMPUTE NBJ-VECUS = FUNCTION INTEGER-OF-DATE(DATE-NAISSANCE)
           ADD NBJ-SHIFT TO NBJ-VECUS
           COMPUTE DATE-SHIFT = FUNCTION DATE-OF-INTEGER(NBJ-VECUS)
           MOVE DATE-SHIFT TO FMT-DATE
           DISPLAY 'AURA 20.000 JOURS LE: ' FMT-DATE
           .
