       IDENTIFICATION DIVISION.
       PROGRAM-ID. TESTCOMP.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 ITEM1 PIC S9(4) COMP-5 VALUE 128.
       77 ITEM2 PIC S9(4) COMP-5 VALUE 127.
       77 SOMME PIC S9(4) COMP-5.

       PROCEDURE DIVISION.
           COMPUTE SOMME = ITEM1 + ITEM2
           DISPLAY SOMME
           GOBACK.
