//APIXDB22 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//STEPRUN  EXEC PGM=IKJEFT01,COND=(4,LT)
//STEPLIB  DD   DSN=API1.SOURCE.PGMLIB,DISP=SHR
//         DD   DSN=API1.COBOL.LOAD,DISP=SHR
//SYSOUT   DD   SYSOUT=*,OUTLIM=1000
//SYSTSPRT DD   SYSOUT=*,OUTLIM=2500
//SYSTSIN  DD   *
  DSN SYSTEM (DSN1)
  RUN PROGRAM(MAOPTP3A) PLAN (MAJAS)
/*
//MVT      DD   DSN=API1.COB.FMVTST,DISP=SHR
//ASS      DD   DSN=API1.COB.ASSURES,DISP=SHR
