            PCB   TYPE=DB,DBDNAME=DBM010,PROCOPT=A,KEYLEN=12
            SENSEG NAME=P010A,PARENT=0
            SENSEG NAME=P010B,PARENT=P010A
            SENSEG NAME=P010C,PARENT=P010A
            PSBGEN PSBNAME=PSB010A,LANG=COBOL,CMPAT=NO
            END
