         PCB   TYPE=...........
         SENSEG NAME=....................
         ...............................
         PSBGEN PSBNAME=PSBIMSXX.............
         END
