* DEFINITION DE VOTRE BASE IMS
         DBD   NAME=DBDIMSXX,ACCESS=(....,....),RMNAME=(DFSHDC40,2,20)
         DATASET DD1=DDDIMSXX,DEVICE=3390,SIZE=4096
         SEGM  NAME=.......................
         FIELD NAME=...............................
         ..........................................
         ..........................................
         ..........................................
         DBDGEN
         END
