//API1ESLO JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* CHARGER DES DONNEES DANS LE ESDS
//*
//LOAD     EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=H
//FIC      DD DSN=API1.COB.MVT,DISP=SHR
//SYSIN    DD *
 REPRO IFILE(FIC) ODS(API1.TEST.ESDS)
/*
