//API1ESCR JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* CREER UN FICHIER ESDS
//*
//CREKSDS  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=H
//SYSIN    DD *
 DELETE API1.TEST.ESDS
 DEF CL (NAME(API1.TEST.ESDS) -
         NIXD /* CREER UN ESDS */ -
         CISZ(4096) /* LONGUEUR DU CI */ -
         TRK(2 2) /* ESPACE DU FICHIER */ -
         RECSZ(80 80) /* LONGUEUR DU RECORD */ -
        ) -
     DATA (NAME(API1.TEST.ESDS.DATA))


