//API1ESPR JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* IMPRIMER LE ESDS
//*
//PRINT    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=H
//FIC      DD SYSOUT=H
//SYSIN    DD *
 REPRO IDS(API1.TEST.ESDS) OUTFILE(FIC)
 PRINT IDS(API1.TEST.ESDS) CHAR
/*
