//API1JCOP JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* IEBCOPY POUR COPIER UNE LIBRAIRIE SUR UNE AUTRE
//*
//COPY     EXEC PGM=IEBCOPY
//SYSUT1   DD   DSN=API1.SOURCE.JCL,DISP=SHR
//SYSUT2   DD   DSN=API1.TEST.LIBRARY,DISP=SHR
//SYSPRINT DD   SYSOUT=H
//SYSIN    DD   *
 COPY INDD=((SYSUT1,R)),OUTDD=SYSUT2
