//IEBGCOPY PROC MEM=JCL01,LIB=JCL,TYPE=SOURCE
//EXECIEBG EXEC PGM=IEBGENER
//SYSUT1   DD   DSN=API1.&TYPE..&LIB(&MEM),DISP=SHR
//SYSUT2   DD   SYSOUT=H
//SYSPRINT DD   SYSOUT=H
//SYSIN    DD   DUMMY
//         PEND
