//PROCTRI PROC
//TRI     EXEC PGM=SORT
//SORTIN  DD DSN=API1.COB.ASSURES,DISP=SHR
//SORTOUT DD SYSOUT=H
//SYSOUT  DD SYSOUT=H
//SYSIN   DD DSN=API1.SOURCE.JCL(&PARMTRI),DISP=SHR
//        PEND
