//API1J12 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* PROCEDURE INTERNE D'IMPRESSION DES MEMBRES DE LA SOURCE.JCL
//*
//IEBGCOPY PROC
//EXECIEBG EXEC PGM=IEBGENER
//SYSUT2   DD   SYSOUT=H
//SYSPRINT DD   SYSOUT=H
//SYSIN    DD   DUMMY
//         PEND
//*
//* EXECUTION DE LA PROCEDURE DE COPIE
//*
//COPY1    EXEC IEBGCOPY
//SYSUT1   DD   DSN=API1.SOURCE.JCL(JCL01),DISP=SHR
//COPY2    EXEC IEBGCOPY
//SYSUT1   DD   DSN=API1.SOURCE.JCL(JCL02),DISP=SHR
//COPY3    EXEC IEBGCOPY
//SYSUT1   DD   DSN=API1.SOURCE.JCL(JCL03),DISP=SHR
//COPY4    EXEC IEBGCOPY
//SYSUT1   DD   DSN=API1.SOURCE.JCL(JCL04),DISP=SHR
