//API1J13 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* PROCEDURE INTERNE D'IMPRESSION DES MEMBRES DE LA SOURCE.JCL
//*
//IEBGCOPY PROC MEM=JCL01
//EXECIEBG EXEC PGM=IEBGENER
//SYSUT1   DD   DSN=API1.SOURCE.JCL(&MEM),DISP=SHR
//SYSUT2   DD   DSN=API1.TEST.LIBRARY(&MEM),DISP=SHR
//SYSPRINT DD   SYSOUT=H
//SYSIN    DD   DUMMY
//         PEND
//*
//* EXECUTION DE LA PROCEDURE DE COPIE
//*
//COPY1    EXEC IEBGCOPY
//COPY2    EXEC IEBGCOPY,MEM=JCL02
//COPY3    EXEC IEBGCOPY,MEM=JCL03
//COPY4    EXEC IEBGCOPY,MEM=JCL04
