//API1J16 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* PROCEDURE EXTERNE D'IMPRESSION DES MEMBRES DE LA SOURCE.JCL
//*
//        JCLLIB ORDER=API1.SOURCE.JCL
//*
//* EXECUTION DE LA PROCEDURE DE COPIE
//*
//COPY1   EXEC IEBGCOPY
//COPY2   EXEC IEBGCOPY,MEM=JCL02
//COPY3   EXEC IEBGCOPY,MEM=JCL03
//COPY4   EXEC IEBGCOPY,MEM=JCL04
