//API1J17 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* PROCEDURE AVEC TRI PARAMETRE
//*
//        JCLLIB ORDER=API1.SOURCE.JCL
//*
//* EXECUTION DU TRI SUR LA VILLE
//*
//EXTRI1  EXEC PROCTRI,PARMTRI=SORTVILL
//*
//* EXECUTION DU TRI SUR LE NUMERO
//*
//EXTRI2  EXEC PROCTRI,PARMTRI=SORTNUM
//*
//* EXECUTION DU TRI SUR LE NOM
//*
//EXTRI3  EXEC PROCTRI,PARMTRI=SORTNOM
