//API1KSPR JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* IMPRIMER LE KSDS
//*
//PRINT    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=H
//FIC      DD SYSOUT=H
//SYSIN    DD *
 REPRO IDS(API1.TEST.KSDS) OUTFILE(FIC)
 PRINT IDS(API1.TEST.KSDS) CHAR
/*
