//API1PATH JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* DEFINITION D'UN PATH POUR ACCEDER A L'AIX
//*
//CREPATH  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=H
//SYSIN    DD *
 DELETE API1.TEST.KSDS.AIX.PATH
 DEF PATH(NAME(API1.TEST.KSDS.AIX.PATH) -
          PATHENTRY(API1.TEST.KSDS.AIX))
/*
//
