//MKCOPY   PROC
//COPY     EXEC  PGM=IEBCOPY
//SYSPRINT DD    SYSOUT=H
//SYSUT1   DD    DSN=&DSSRC,DISP=SHR
//SYSUT2   DD    DSN=&DSDST,DISP=(NEW,CATLG),
//         SPACE=(CYL,(1,1,30)),LRECL=80,BLKSIZE=27920,RECFM=FB
//SYSIN    DD    *
 COPY INDD=SYSUT1,OUTDD=SYSUT2
//         PEND
