//API1RRPR JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* IMPRIMER LE RRDS
//*
//PRINT    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=H
//FIC      DD SYSOUT=H
//SYSIN    DD *
 REPRO IDS(API1.TEST.RRDS) OUTFILE(FIC)
 PRINT IDS(API1.TEST.RRDS) CHAR
/*
