//API1ESCR JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* CREER UN FICHIER RRDS
//*
//CREKSDS  EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=H
//SYSIN    DD *
 DELETE API1.TEST.RRDS
 DEF CL (NAME(API1.TEST.RRDS) -
         NUMBERED /* CREER UN RRDS */ -
         CISZ(4096) /* LONGUEUR DU CI */ -
         REC(100) /* NOMBRE DE RECORDS */ -
         RECSZ(80 80) /* LONGUEUR DU RECORD */ -
        ) -
     DATA (NAME(API1.TEST.RRDS.DATA))


