//API1RRLO JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* CHARGER DES DONNEES DANS LE RRDS
//*
//LOAD     EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=H
//FIC      DD *
00001RECORD 1
00002RECORD 2
00003RECORD 3
00004RECORD 4
00005RECORD 5
00006RECORD 6
/*
//SYSIN    DD *
 REPRO IFILE(FIC) ODS(API1.TEST.RRDS)
/*
