//PROC2     PROC
//SORTF     EXEC PGM=SORT
//SORTIN    DD DSN=&SRC,DISP=SHR
//SORTOUT   DD DSN=&DST,DISP=(MOD,CATLG),
// SPACE=(TRK,(1,1)),LRECL=80,BLKSIZE=800,RECFM=FB
//SYSOUT    DD SYSOUT=H
//          PEND
