//PROC1     PROC DSTSPA=(TRK,(1,1)),DSTRECL=80,DSTBLK=800
//COPYPS    EXEC PGM=IEBGENER
//SYSUT1    DD DSN=&SRC,DISP=SHR
//SYSUT2    DD DSN=&DST,DISP=(NEW,CATLG),
// SPACE=&DSTSPA,LRECL=&DSTRECL,BLKSIZE=&DSTBLK,RECFM=FB
//SYSPRINT  DD SYSOUT=H
//SYSIN     DD DUMMY
//          PEND
