//API1CEDS  JOB   CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//*
//*
//CREPS     EXEC  PGM=IEFBR14
//FIPS      DD    DSN=API1.ACTIF.SEQ1,DISP=(NEW,CATLG),
// SPACE=(TRK,(25,1)),LRECL=80,BLKSIZE=800,RECFM=FB
//CREPO     EXEC  PGM=IEFBR14
//FIPO      DD    DSN=API1.ACTIF.PDS1,DISP=(NEW,CATLG),
// SPACE=(TRK,(1,1,20)),LRECL=80,BLKSIZE=27920,RECFM=FB
