//API1UPD JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* IEBUPDTE POUR STOCKER DES MEMBRES DANS UN PDS
//*
//STEP1    EXEC  PGM=IEBUPDTE
//SYSUT1   DD    DSN=API1.SOURCE.JCL,DISP=SHR
//SYSUT2   DD    DSN=API1.SOURCE.JCL,DISP=SHR
//SYSPRINT DD    SYSOUT=H
//SYSIN    DD    *
./ REPL NAME=JCL1
11331122222222222111
./ REPL NAME=JCL2
11113311111122222222
./ REPL NAME=JCL3
12222133111111111111
./ ADD  NAME=JCL4
12444444441111111111
