//API1JCL1 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,2)
//*
//STEP1     EXEC PGM=IEFBR14
//NEWSEQ    DD DSN=API1.ACTIF.SEQ1,DISP=(MOD,CATLG),
// SPACE=(TRK,(25,2)),LRECL=80,BLKSIZE=800,RECFM=FB
//SYSIN     DD DUMMY
//*
//STEP2     EXEC PGM=IEFBR14
//NEWPDS    DD DSN=API1.ACTIF.PDS1,DISP=(MOD,CATLG),
// SPACE=(TRK,(1,1,20)),LRECL=80,BLKSIZE=27920,RECFM=FB
//SYSIN     DD DUMMY
