       IDENTIFICATION DIVISION.
       PROGRAM-ID. EXEMPLE.
       ENVIRONMENT DIVISION.
       DATA DIVISION.

       WORKING-STORAGE SECTION.
           EXEC SQL
              INCLUDE SQLCA
           END-EXEC.
           EXEC SQL
              INCLUDE EMPLOYE
           END-EXEC.
      *    PARAMETRES DSNTIAR
       01  ERR-MSG.
           05  ERR-LONG   PIC S9(4) COMP VALUE +720.
           05  ERR-TXT    PIC X(72) OCCURS 10 TIMES.
       01  ERR-TXT-LONG   PIC S9(9) COMP VALUE 72.
       01  I              PIC 99.
       PROCEDURE DIVISION.
      *
           EXEC SQL
              WHENEVER SQLERROR GOTO :PARAG-ERR
           END-EXEC
      *
       PARAG1.
           EXEC SQL
              SELECT MAT,NOM
                INTO :MAT,:NOM
                FROM EMPLOYE
               WHERE NOM='HARIBO'
           END-EXEC
           IF SQLCODE = ZERO
           DISPLAY 'MAT: ' MAT ', NOM : ' NOM
           .
       PARAG-FIN.
           STOP RUN.
       PARAG-ERR.
           DISPLAY 'ERREUR DB2'
           DISPLAY 'APPEL DSNTIAR (MISE EN FORME SQLCA)'
           CALL 'DSNTIAR' USING SQLCA, ERR-MSG, ERR-TXT-LONG
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
              DISPLAY ERR-TXT (I)
           END-PERFORM
           STOP RUN.
