       IDENTIFICATION DIVISION.

      * DESCRIPTION DU PROGRAMME :
      * RECUPERE LES LABELS DES MESSAGES D'ERREUR A PARTIR D'UN CODE,
      * DEPUIS UNE TABLE DB2

       PROGRAM-ID. MAJASSP.
       AUTHOR. QUENTIN POTEREK.
       DATE-WRITTEN. 10 JANVIER 2021.

      * --------------------
      * ENVIRONMENT DIVISION
      * --------------------

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
           IBM-370.
      *    IBM-370 WITH DEBUGGING MODE.
       OBJECT-COMPUTER. IBM-370.

      * -------------
      * DATA DIVISION
      * -------------

       DATA DIVISION.

       WORKING-STORAGE SECTION.

           EXEC SQL
             INCLUDE SQLCA
           END-EXEC

           EXEC SQL
             INCLUDE MESSDB2
           END-EXEC

      *VARIABLES UTILISEES PAR DSNTIAR

       01 ERR-MSG.
         02 ERR-LONG PIC S9(4) COMP VALUE +720.
         02 ERR-TXT  PIC X(75) OCCURS 10 TIMES.
       01 ERR-TXT-LONG PIC S9(9) COMP VALUE 72.
       01 I PIC 99.

      *ZONES D'ECHANGE

       01 T-NUM    PIC X(3).
       01 T-MES    PIC X(60).

       LINKAGE SECTION.

       01 PARM.
         02 P-NUM PIC 999.
         02 P-MES PIC X(60).

      * ------------------
      * PROCEDURE DIVISION
      * ------------------

       PROCEDURE DIVISION USING PARM.
           EXEC SQL
             WHENEVER SQLERROR GOTO :PARAG-ERR
           END-EXEC

           MOVE P-NUM TO T-NUM
           MOVE SPACES TO T-MES
           PERFORM LIRE-ENREGISTREMENT
           MOVE T-MES TO P-MES
           GOBACK
           .

       LIRE-ENREGISTREMENT.
           EXEC SQL
             SELECT MES INTO :T-MES
             FROM API1.MESSDB2
             WHERE NUM = :T-NUM
           END-EXEC
           .

       PARAG-ERR.
           DISPLAY 'ERREUR DB2'
           DISPLAY 'APPEL DSNTIAR (MISE EN FORME SQLCA)'
           CALL 'DSNTIAR' USING SQLCA, ERR-MSG, ERR-TXT-LONG
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
              DISPLAY ERR-TXT (I)
           END-PERFORM
           GOBACK
           .
