       IDENTIFICATION DIVISION.
       PROGRAM-ID. TPPGM3.
       AUTHOR. QUENTIN POTEREK.
       DATE-WRITTEN. 05 JANVIER 2022.


       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
      *      IBM-370.
             IBM-370 WITH DEBUGGING MODE.
       OBJECT-COMPUTER.
             IBM-370.


       DATA DIVISION.

       WORKING-STORAGE SECTION.

      *STRUCTURE DE LA TABLE SQLCA
           EXEC SQL
             INCLUDE SQLCA
           END-EXEC

      *STRUCTURE DE LA TABLE RAYONS
           EXEC SQL
             INCLUDE RAYONS
           END-EXEC

      *STRUCTURE DE LA TABLE AUTEURS
           EXEC SQL
             INCLUDE AUTEURS
           END-EXEC

      *VARIABLES UTILISEES PAR DSNTIAR
       01 ERR-MSG.
         02 ERR-LONG PIC S9(4) COMP VALUE +720.
         02 ERR-TXT  PIC X(75) OCCURS 10 TIMES.

       01 ERR-TXT-LONG PIC S9(9) COMP VALUE 72.

      *VARIABLES UTILITAIRES
       01 I PIC 99.
       01 SALLEX PIC X.
       01 ED-TB-AUTEURS.
         02 ED-AUTEUR PIC X(8).
         02 FILLER    PIC X VALUE ' '.
         02 ED-NE-EN  PIC ZZZ9.
         02 FILLER    PIC X VALUE ' '.
         02 ED-LIEU   PIC X(20).
         02 FILLER    PIC X VALUE ' '.
         02 ED-RAYON  PIC X.

      *DECLARATION CURSEURS

      *    QUESTION 1

           EXEC SQL
             DECLARE C_RAYONS_1 CURSOR FOR
               SELECT RAYON
               FROM API1.RAYONS
               WHERE SALLE = :SALLEX
             FOR FETCH ONLY
           END-EXEC

           EXEC SQL
             DECLARE C_AUTEURS_1 CURSOR FOR
               SELECT *
               FROM API1.AUTEURS
               WHERE RAYON = :DCLRAYONS.RAYON
             FOR FETCH ONLY
           END-EXEC

       PROCEDURE DIVISION.
           PERFORM RACINE
           GOBACK
           .

      * -------------------------------------------------------------- *

      * PARAGRAPHES UTILITAIRES

       PARAG-ERR.
           DISPLAY 'ERREUR DB2'
           DISPLAY 'APPEL DSNTIAR (MISE EN FORME SQLCA)'
           CALL 'DSNTIAR' USING SQLCA, ERR-MSG, ERR-TXT-LONG
           PERFORM VARYING I FROM 1 BY 1 UNTIL I > 10
              DISPLAY ERR-TXT (I)
           END-PERFORM
           STOP RUN.

      *CURSEURS

       Q1-CURS-RAYONS-OPEN.
           EXEC SQL
             OPEN C_RAYONS_1
           END-EXEC
           .

       Q1-CURS-RAYONS-FETCH.
           INITIALIZE DCLRAYONS
           EXEC SQL
             FETCH C_RAYONS_1
             INTO :DCLRAYONS
           END-EXEC
           .

       Q1-CURS-RAYONS-CLOSE.
           EXEC SQL
             CLOSE C_RAYONS_1
           END-EXEC
           .

       Q1-CURS-AUTEURS-OPEN.
           EXEC SQL
             OPEN C_AUTEURS_1
           END-EXEC
           .

       Q1-CURS-AUTEURS-FETCH.
           INITIALIZE DCLAUTEURS
           EXEC SQL
             FETCH C_AUTEURS_1
             INTO :DCLAUTEURS
           END-EXEC
           .

       Q1-CURS-AUTEURS-CLOSE.
           EXEC SQL
             CLOSE C_AUTEURS_1
           END-EXEC
           .

      *CORPS D'EXECUTION DU PROGRAMME

       RACINE.
           EXEC SQL
             WHENEVER SQLERROR GOTO :PARAG-ERR
           END-EXEC
           PERFORM QUESTION-4
           .

       QUESTION-1-0.
           ACCEPT SALLEX
           PERFORM Q1-CURS-RAYONS-OPEN
           PERFORM Q1-CURS-RAYONS-FETCH
      *    ITERER SUR LES RAYONS DE LA SALLE FOURNIE EN PARM
           PERFORM UNTIL SQLCODE NOT = ZERO
             PERFORM Q1-CURS-AUTEURS-OPEN
             PERFORM Q1-CURS-AUTEURS-FETCH
      *      ITERER SUR LES AUTEURS DU RAYON ACTUEL
             PERFORM UNTIL SQLCODE NOT = ZERO
               PERFORM QUESTION-1-1
               DISPLAY ED-TB-AUTEURS
               PERFORM Q1-CURS-AUTEURS-FETCH
             END-PERFORM
             MOVE ZERO TO SQLCODE
             PERFORM Q1-CURS-AUTEURS-CLOSE
             PERFORM Q1-CURS-RAYONS-FETCH
           END-PERFORM
           PERFORM Q1-CURS-RAYONS-CLOSE
           .

       QUESTION-1-1.
           MOVE SPACES              TO ED-TB-AUTEURS
           MOVE AUTEUR-TEXT         TO ED-AUTEUR
           MOVE NE-EN               TO ED-NE-EN
           MOVE LIEU-TEXT           TO ED-LIEU
           MOVE RAYON OF DCLAUTEURS TO ED-RAYON
           .

       QUESTION-2.
           EXEC SQL
             DELETE FROM API1.AUTEURS
             WHERE RAYON = '3'
           END-EXEC
           .

       QUESTION-3.
           EXEC SQL
             DELETE FROM API1.RAYONS
             WHERE RAYON = '1'
           END-EXEC
           .

       QUESTION-4.
           EXEC SQL
             UPDATE API1.RAYONS
             SET RAYON = '9'
             WHERE RAYON = '6'
           END-EXEC
           .
