//API1ALG3 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,2)
//*
//* ALGORITHME 3 - FUSION DE FICHIERS
//*
//ALG3     EXEC PGM=ALGO3V2
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//CLIENT1  DD DSN=API1.SOURCE.COBOL(ALGO3C1),DISP=SHR
//CLIENT2  DD DSN=API1.SOURCE.COBOL(ALGO3C2),DISP=SHR
//CLIENTF  DD SYSOUT=H
//SYSOUT   DD SYSOUT=H
//
