//API1ALG6 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,2)
//*
//* ALGORITHME 6
//*
//ALG6     EXEC PGM=ALGO6
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//CLIENT   DD DSN=API1.SOURCE.COBOL(ALGO6CLI),DISP=SHR
//ADRESSES DD SYSOUT=H
//SYSOUT   DD SYSOUT=H
//
