//API1ALG7 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,2)
//*
//* ALGORITHME 7
//*
//ALG7     EXEC PGM=ALGO7
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//NOTES    DD DSN=API1.SOURCE.COBOL(ALGO7NO1),DISP=SHR
//ADRESSES DD SYSOUT=H
//SYSOUT   DD SYSOUT=H
//
