//API1ALG4 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,2)
//*
//* ALGORITHME 4 - APPARIEMENT DE FICHIERS
//*
//ALG3     EXEC PGM=ALGO4V2
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//REG      DD DSN=API1.SOURCE.COBOL(ALGO4REG),DISP=SHR
//MVT      DD DSN=API1.SOURCE.COBOL(ALGO4MVT),DISP=SHR
//REC      DD SYSOUT=H
//SYSOUT   DD SYSOUT=H
//
