//API1ALG5 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,2)
//*
//* ALGORITHME 5
//*
//ALG5     EXEC PGM=ALGO5V2
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//FRANCE   DD DSN=API15.HABITANT.QSAM,DISP=SHR
//STATS    DD SYSOUT=H
//SYSOUT   DD SYSOUT=H
//
