//API1KSDS JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//*
//*
//COBKSDS  EXEC PGM=COBKSDS
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//FIC1     DD DSN=API1.ACTIF.FICH01,DISP=SHR
//SYSOUT   DD SYSOUT=H
