//API1CRJ  JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* ENVOI D'UN CODE RETOUR 20
//*
//RET      EXEC PGM=CODERET,PARM=0025
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//
