//API1ALG1 JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,2)
//*
//*
//*
//PROCSTOC EXEC PGM=EXALGO1
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=H
//STCKFILE DD DSN=API1.SOURCE.COBOL(ALGO1STO),DISP=SHR
//CMPTFILE DD SYSOUT=H
//DPSSFILE DD SYSOUT=H
//ALRTFILE DD SYSOUT=H
