//API1CEED JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* EXECUTER LE PROGRAMME EXCDAYS QUI APPELLE CEEDAYS
//*
//NBJ      EXEC PGM=EXCDAYS
//STEPLIB  DD   DSN=API1.COBOL.LOAD,DISP=SHR
//SYSOUT   DD   SYSOUT=H
//
