//API1EXLO JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* TEST SUR LES SOUS-PROGRAMMES EN ETAT INITIAL, ET LOCAL STORAGE
//*
//EXLOC    EXEC PGM=EXLOCPP
//STEPLIB  DD   DSN=API1.COBOL.LOAD,DISP=SHR
//SYSOUT   DD   SYSOUT=H

