//API1EXRP JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,2)
//*
//* EXORPRT
//*
//RAPPORT  EXEC PGM=EXORPRT2,PARM='API1.SOURCE.COBOL(MAJAS2),API1'
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=H
//PGM      DD DSN=API1.SOURCE.COBOL(MAJAS2),DISP=SHR
//
