//API1EXST JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,2)
//*
//* EXOSTRING
//*
//STRINGS  EXEC PGM=EXOSTR,
// PARM='AAAAAAA?BBBBB,CCCCC-DDDDDDDDDDDDD'
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=H
//SYSIN    DD *
A
/*
//
