//API1NCJ  JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* UTILISATION DES NOMS CONDITION
//*
//COND     EXEC PGM=NOMCOND
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=H
