//API1DATE JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* AFFICHAGE DE LA DATE FORMATEE
//*
//PDATE    EXEC PGM=PDATE
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=H
//
