//API1QUIT JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,2)
//* ----------
//* QUITTANCES
//* ----------
//*
//* CREATION DU FICHIER DE QUITTANCES
//*
//EXQUIT   EXEC PGM=QUITPP,PARM=&SYSUID
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//ASSURES  DD DSN=API1.COB.ASSURES,DISP=SHR
//QUITTCE  DD SYSOUT=H
//SYSOUT   DD SYSOUT=H
//
