//API1ECMV JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//* ----------
//* TD COBOL MV
//* -----------
//*
//* CONTROLE DES MOUVEMENTS
//*
//*COBMV    EXEC PGM=TDCOBMV,PARM=&SYSUID
//*COBMV    EXEC PGM=TDCOBMV2,PARM=&SYSUID
//COBMV    EXEC PGM=TDCOBMV3,PARM=&SYSUID
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=H
//*MVT      DD DSN=API1.COB.MVT,DISP=SHR
//MVT      DD DSN=API1.COB.MVTMAJ,DISP=SHR
//STA      DD SYSOUT=H
//ERR      DD SYSOUT=H
//
