//API1JUST JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* TESTER LA JUSTIFICATION AVEC JUSTIFIED RIGHT
//*
//JUSTIFY  EXEC PGM=TESTJUST
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=H
