//API1COMP JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//* -----------
//* TEST COMP5
//* -----------
//*
//* TEST SUR LE COMP 5
//*
//COBMV    EXEC PGM=TESTCOMP,PARM=&SYSUID
//STEPLIB  DD DSN=API1.COBOL.LOAD,DISP=SHR
//SYSOUT   DD SYSOUT=H
//
