//API1VEN JOB CLASS=A,MSGCLASS=H,NOTIFY=&SYSUID,TIME=(,1)
//*
//* PROGRAMME LISTE DES VENTES AVEC TABLEAUX
//*
//VENTE    EXEC PGM=VENTES
//STEPLIB  DD   DSN=API15.COBOL.LOAD,DISP=SHR
//VENTES   DD   DSN=API15.SOURCE.COBOL(VENTESF),DISP=SHR
//IMP      DD   SYSOUT=H
//SYSOUT   DD   SYSOUT=H
